# CtrlPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbSpline..::..CtrlPoints Property
NurbSpline Class See Also
---
Returns the control points of the nurb spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> CtrlPoints { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CtrlPoints As IList(Of XYZ)
	Get
```

Visual C++
---
```text
public:
property IList<XYZ^>^ CtrlPoints {
	IList<XYZ^>^ get ();
}
```

# See Also
NurbSpline Class
Autodesk.Revit.DB Namespace